<!DOCTYPE html>
<html lang="es">
    <head>
        <meta charset="UTF-8">
        <meta name="viewport" content="width=device-width, initial-
        scale=1.0">
        <meta name="description" content="Historia de las aplicaciones web,
        sus orígenes, evolución y el impacto actual.">
        <meta name="keywords" content="Historia, Web, Aplicaciones,
        Evolución">
        <title>Historia de Aplicaciones Web</title>
        <style>
            body { font-family: Arial, sans-serif; margin: 20px; }
            nav a { margin-right: 15px; text-decoration: none; color:
            #2980B9; }
            section { margin-bottom: 40px; }
        </style>
    </head>
    <body>
        <nav>
            <a href="practica_2_2.html">Inicio</a>
            <a href="historiaWeb.html">Historia Web</a>
            <a href="cv.html">CV</a>
        </nav>
        <header>
            <h1>Historia de Aplicaciones Web</h1>
            <p>Explora los hitos hist&oacute;ricos de la web.</p>
        </header>
        
        <section id="indice">
            <h2>&Iacute;ndice del contenido</h2>
            <ul>
                <li><a href="#origenes">Origenes</a></li>
                <ul><li><a href="#aplicaciones">Primeras aplicaciones</a></li></ul>
                <li><a href="#evolucion">Evoluci&oacute;n</a></li>
                <ul>
                    <li><a href="#web1">Web 1.0</a></li>
                    <li><a href="#web2">Web 2.0</a></li>
                    <li><a href="#web3">Web 3.0</a></li>
                    <li><a href="#web4">Web 4.0</a></li>
                </ul>
                <li><a href="#impacto">Impacto</a></li>
            </ul>
        </section>

        <section id="origenes">
            <h2>Or&iacute;genes</h2>
            <p>La web tiene sus or&iacute;genes en el proyecto <strong>World Wide Web (WWW)</strong>, desarrollado por <strong>Tim Berners-Lee</strong> 
                en 1989 mientras trabajaba en el CERN (Organizaci&oacute;n Europea para la Investigaci&oacute;n Nuclear). 
                Su objetivo era facilitar el intercambio de informaci&oacute;n entre cient&iacute;ficos de todo el mundo. 
                Para ello, Berners-Lee cre&oacute; tres tecnolog&iacute;as fundamentales:</p>
            <ol>
                <li><strong>HTML (HyperText Markup Language)</strong>: Lenguaje de marcado para estructurar documentos web.</li>
                <li><strong>HTTP (HyperText Transfer Protocol)</strong>: Protocolo para la transferencia de datos en la web.</li>
                <li><strong>URL (Uniform Resource Locator)</strong>: Sistema de direcciones para localizar recursos en la web.</li>
            </ol>
            <p>En 1991, la primera p&aacute;gina web fue publicada en el servidor del CERN, explicando el concepto de la web y c&oacute;mo usarla.</p>
            <section id="aplicaciones">
                <h3>Primeras aplicaciones</h3>
                <p>Las primeras aplicaciones web fueron muy simples y estaban diseñadas para compartir informaci&oacute;n 
                    de manera est&aacute;tica. Algunos hitos importantes incluyen:</p>
                <ul>
                    <li><strong>1993</strong>: Se lanza Mosaic, el primer navegador web con interfaz gr&aacute;fica, 
                        desarrollado por el NCSA (National Center for Supercomputing Applications).</li>
                    <li><strong>1994</strong>: Se funda Netscape, que populariz&oacute; el uso de navegadores con 
                        Netscape Navigator.</li>
                    <li><strong>1995</strong>: Aparece JavaScript, desarrollado por Netscape, permitiendo 
                        interactividad en las p&aacute;ginas web. Tambi&eacute;n se lanza PHP, que facilit&oacute; la creaci&oacute;n 
                        de sitios din&aacute;micos.</li>
                    <li><strong>Finales de los 90</strong>: Surgen los primeros sitios de comercio electr&oacute;nico 
                        como Amazon (1995) y eBay (1995), junto con servicios en l&iacute;nea como Hotmail (1996) y 
                        Google (1998).</li>
                </ul>
            </section>
            <a href="#indice">Regresar al &iacute;ndice</a>
        </section>
        
        <section id="evolucion">
            <h2>Evoluci&oacute;n</h2>
            <section id="web1">
                <h3>¿Qu&eacute; es la Web 1.0?: la web est&aacute;tica</h3>
                <p>La fase inicial de la web, conocida como Web 1.0 o web est&aacute;tica, abarc&oacute; desde 1991 hasta 2003. 
                    Durante este per&iacute;odo, las p&aacute;ginas web eran principalmente estáticas y la interacci&oacute;n entre 
                    el usuario y el sitio web era bastante limitada.</p>
                <p>Estos primeros d&iacute;as de la web se caracterizaron por su simplicidad y velocidad. 
                    Los usuarios eran principalmente consumidores de contenido que era subido a los servidores 
                    por expertos inform&aacute;ticos. En este tiempo, los navegadores eran principalmente de texto, 
                    y a pesar de su sencillez, se destacaban por su rapidez.</p>
                <p>La introducción del lenguaje HTML represent&aacute; un avance significativo para la Web 1.0. 
                    Este lenguaje permiti&oacute; una estructuraci&oacute;n mejorada y contenidos m&aacute;s atractivos para la 
                    lectura. A pesar de esta mejora, la interactividad del usuario con la web segu&iacute;a siendo 
                    limitada. En esta etapa, la web se asemejaba a un libro digital donde se pod&iacute;a buscar y 
                    leer informaci&oacute;n, pero las posibilidades de interactuar eran limitadas.</p>
                <a href="#indice">Regresar al &iacute;ndice</a>
            </section>
            <section id="web2">
                <h3>¿Qu&eacute; es la Web 2.0?: la Web Social</h3>
                <p>La Web 2.0 representa la segunda fase en la evoluci&oacute;n de la web, que abarca desde 2004 
                    hasta la actualidad. Esta etapa marc&oacute; la introducci&oacute;n de la interactividad y la 
                    colaboración en la red. Surgieron las redes sociales y los blogs, lo que proporcion&oacute; 
                    a los usuarios la capacidad no solo de consumir contenido, sino tambi&eacute;n de crearlo.</p>
                <p>El cambio hacia la Web 2.0 surgi&oacute; en gran medida como respuesta a la crisis de las 
                    empresas .com. Esta fase introdujo tres principios fundamentales que permitieron la 
                    interacci&oacute;n de los usuarios con las plataformas web: la concepci&oacute;n de la web como 
                    plataforma en s&iacute; misma, el concepto de inteligencia colectiva y la implementaci&oacute;n de 
                    una arquitectura de participaci&oacute;n.</p>
                <p>La Web 2.0 presenci&oacute; el surgimiento de comunidades de usuarios, redes sociales, blogs 
                    y wikis, todos estos aspectos fomentaron la colaboraci&oacute;n entre individuos. En este 
                    contexto, el usuario dej&oacute; de ser un simple receptor de informaci&oacute;n para convertirse 
                    tambi&eacute;n en un generador activo de contenido.</p>
                <a href="#indice">Regresar al &iacute;ndice</a>
            </section>
            <section id="web3">
                <h3>¿Qu&eacute; es la Web 3.0?: la web sem&aacute;ntica</h3>
                <p>Al surgir alrededor de 2010, la Web 3.0, tambi&eacute;n conocida como web sem&aacute;ntica, marc&oacute; un 
                    cambio significativo en la estructuraci&oacute;n y accesibilidad de la informaci&oacute;n en la red. 
                    Esta nueva fase se enfoc&oacute; en interconectar las p&aacute;ginas web de manera sem&aacute;ntica para 
                    facilitar la b&uacute;squeda y recuperaci&oacute;n de informaci&oacute;n de forma m&aacute;s &aacute;gil y eficiente 
                    gracias a su organizaci&oacute;n estructurada. Este periodo abri&oacute; nuevas posibilidades de 
                    comunicaci&oacute;n y colaboraci&oacute;n mediante el uso de espacios tridimensionales y 
                    tecnolog&iacute;a inteligente.</p>
                <p>En la Web 3.0, el contenido y el conocimiento se relacionan de manera m&aacute;s eficaz para 
                    lograr una mayor eficiencia gracias a la visi&oacute;n tridimensional de la web y la 
                    integraci&oacute;n de dispositivos y tecnolog&iacute;as inteligentes. Aunque se encuentra en una 
                    etapa inicial de implementaci&oacute;n, ya estamos presenciando su crecimiento y desarrollo 
                    a trav&eacute;s de proyectos que emplean tecnolog&iacute;as como blockchain e inteligencia artificial.</p>
                <a href="#indice">Regresar al &iacute;ndice</a>
            </section>
            <section id="web4">
                <h3>¿Qu&eacute; es la Web 4.0?: la web conectada</h3>
                <p>Si bien a&uacute;n se encuentra en fase de desarrollo, la Web 4.0 representa la promesa de 
                    una era marcada por una conectividad total. Este nuevo estadio integra la Internet 
                    de las cosas (IoT), la realidad aumentada y otros avances para generar una 
                    experiencia de usuario completamente inmersiva.</p>
                <p>En la Web 4.0, la inteligencia artificial ocupa un lugar central como tecnolog&iacute;a 
                    principal para permitir que los sitios sean inteligentes y capaces de interactuar 
                    y adaptarse a las necesidades de los usuarios. Por este motivo, se asocia la Web 
                    4.0 con un enfoque predictivo en la web.</p>
                <p>Adem&aacute;s, la Web 4.0 introduce nuevas formas de interacci&oacute;n con el usuario y facilita 
                    la comunicaci&oacute;n entre dispositivos (m&aacute;quina a m&aacute;quina, o M2M). Por ejemplo, es 
                    factible emitir una orden por voz y que esta se cumpla de manera efectiva y eficiente.</p>
                <a href="#indice">Regresar al &iacute;ndice</a>
            </section>
        </section>
        
        <section id="impacto">
            <h2>Impacto Actual</h2>
            <p>Las aplicaciones web han revolucionado la sociedad moderna en m&uacute;ltiples aspectos:</p>
            <ul>
                <li><strong>Comunicaci&oacute;n</strong>: Redes sociales, mensajer&iacute;a y videoconferencias conectan a las personas en todo el mundo.</li>
                <li><strong>Econom&iacute;a</strong>: El comercio electr&oacute;nico, la banca en l&iacute;nea y la econom&iacute;a colaborativa han cambiado la forma de comprar y trabajar.</li>
                <li><strong>Educaci&oacute;n</strong>: Plataformas de aprendizaje y bibliotecas digitales facilitan el acceso al conocimiento.</li>
                <li><strong>Salud</strong>: La telemedicina y las apps de bienestar mejoran el acceso a servicios m&eacute;dicos.</li>
                <li><strong>Gobierno</strong>: Tr&aacute;mites en l&iacute;nea y participaci&oacute;n digital agilizan la relaci&oacute;n ciudadano-estado.</li>
                <li><strong>Entretenimiento</strong>: Streaming y herramientas de creaci&oacute;n han transformado el consumo de contenido.</li>
            </ul>
            <a href="#indice">Regresar al &iacute;ndice</a>
        </section>
    </body>
</html>